[Information]
; (Latest Translator, First Translator, Second Translator ...)
TRANSLATOR=Hrant Ohanyan
VERSION=6.2.0

[Language]
LANGUAGE=Armenian 
CHARACTER_CODE=Unicode (UTF-16, LE, w/ BOM)
LOCALE_ID=0x002B, 0x042B


[Url]
WIKIPEDIA_SMART=http://en.wikipedia.org/wiki/Self-Monitoring%2C_Analysis_and_Reporting_Technology

[Menu]
FILE=&Ֆայլ
CUSTOMIZE=&Կարգավորել
EXIT=&Փակել
EDIT=&Խմբագրել
COPY=&Պատճենել
FUNCTION=Գ&ործառույթ
HIDE_SMART_INFO=Թաքցնել &S.M.A.R.T. տեղեկությունը
HIDE_SERIAL_NUMBER=Թաքցնել հաջորդական &համարը
SHOW_DRIVE_LETTER=Ցուցադրել &հիշասարքի տառը
ADVANCED_DISK_SEARCH=&Հիշասարքերի ընդլայնված որոնում
EVENT_LOG=&Մատյան
AAM_APM_CONTROL=AA&M/APM-ի կառավար
AUTO_AAM_APM_ADAPTION=AAM/A&PM-ի ինքնակարգավորում
RESIDENT=Գոր&ծակալ
STARTUP=&Ինքնամեկնարկ
OPEN_DISK_MANAGEMENT=Բացել "&Սկավառակի կառավարումը"
OPEN_DEVICE_MANAGER=Բացել "&Սարքի կառավարիչ"
ADVANCED_FEATURE=Ընդլայնված &կարգավորումներ
REFRESH=&Թարմացնել
RESCAN=Վեր&ստուգել
DISABLE=&Անջտատել
AUTO_REFRESH=&Ինքնաթարմացում
AUTO_REFRESH_TARGET=Թիրախի &ինքնաթարմացում՝
AUTO_REFRESH_TARGET_ALL_DISK=Ինքնաթարմացում՝ թիրա&խավորել ամբողջ սկավառակը
AUTO_REFRESH_UNTARGET_ALL_DISK=Ինքնաթարմացում՝ &ապաթիրախավորել ամբողջ սկավառակը
WAIT_TIME_AT_STARTUP=&Սպսել մեկնարկի ժամանակ
GRAPH=&Գրաֆ
THEME=&Ձևավորում
DISK=&Սկավառակ
HELP=&Օգնություն
HELP_WEB=&Օգնություն [առցանց]
HELP_ABOUT=&CrystalDiskInfo ծրագրի մասին
HELP_ABOUT_SMART=&S.M.A.R.T. տեխնոլոգիայի մասին (Wikipedia) [Web]
LANGUAGE=Լեզու
ITEM=&Տարր
TEMPERATURE_TYPE=&Ջերմաստիճանի միավոր
CELSIUS=Ցելսիուս (°C)
FAHRENHEIT=Ֆարենհեյթ (°F)
HEALTH_STATUS_SETTING=&Առողջության վիճակի կարգավորումներ

;Graph
OPTION=&Ընտրանքներ
LEGEND_POSITION=&Պայմանանշանների դիրք
NORTH_WEST=&Հյուսիս-արևմուտք
NORTH_EAST=Հյուսիս-&արևելք
SOUTH_WEST=Հարավ-&արևմուտք
SOUTH_EAST=&Հարավ-արևելք
MAX_PLOT_POINT=Առվլ. կետ
TIME_FORMAT=&Ժամանակի ձևաչափ
PAINT_WEEKEND=Ցուցադրելդադարները 
ALL=&Բոլորը

;2.7.0
COPY_OPTION=Պատճենել &ընտրանքը
RESIDENT_STYLE=Ձևավորման &ոճ
MINIMIZE=Նվազեցնել
HIDE=Թաքցնել

;3.0.0
ZOOM=&Չափորոշում
AUTO=&Ծրագրային
ATTRIBUTE=&Հատկանիշ

;3.5.0
ASCII_VIEW=ASCII տեսքով
AUTO_DTECTION=Ինքնահայտնաբերում
SECOND=վայր.
MINUTE=րոպե
HOUR=ժամ

:3.9.4
WORKAROUND=Սխալների շ&րջանցում

;4.0.0
ALERT_MAIL=Ահազանգել էլ.փոստով
MAIL_SETTINGS=Էլ.փոստի կարգավորումներ
SMART_IN_ENGLISH=S.M.A.R.T.-ը անգլերենով
FONT_SETTING=Տառատեսակ

;5.0.0
ALERT_FEATURES=Զ&գուշացման յուրահատկություններ
ALARM_HISTORY=Ահազանգերի պատմություն
ALERT_SOUND=Ահազանգի ձայնը
SOUND_SETTINGS=Ձայնի կարգավորումներ
GADGET_SUPPORT=Gadget-ի աջակցում
INSTALL_GADGET=Տեղադրել Gadget-ը
ENABLE_AUTO=Միացնել (ինքնահայտնաբերում)
ENABLE_ALL=Միացնել (Բոլոր սկավառակները)
ENABLE_RAID=Միացնել (RAID հատորը միայն)

;6.0.0
HIDE_NO_SMART_DISK=&Թաքցնել ոչ S.M.A.R.T. սկավառակը
GREEN_MODE=&Կանաչ եղանակ

[TrayMenu]
EXIT=Փակել
REFRESH=Թարմացնել
RESIDENT=Վերստուգել
ENABLE=Միացնել
DISABLE=Անջտատել
ENABLE_ALL=Միացնել բոլորը
DISABLE_ALL=Անջատել բոլորը
AUTO_REFRESH=Ինքնաթարմացում
AUTO_REFRESH_01_MIN=1 ր.
AUTO_REFRESH_03_MIN=3 ր.
AUTO_REFRESH_05_MIN=5 ր.
AUTO_REFRESH_10_MIN=10 ր.
AUTO_REFRESH_30_MIN=30 ր.
AUTO_REFRESH_60_MIN=60 ր.
AUTO_REFRESH_TARGET=Ընտրված է ինքնաթարմացում՝
AUTO_REFRESH_TARGET_ALL_DISK=Ինքնաթարմացում՝ թիրա&խավորել ամբողջ սկավառակը
AUTO_REFRESH_UNTARGET_ALL_DISK=Ինքնաթարմացում՝ &ապաթիրախավորել ամբողջ սկավառակը
ALARM_SETTING_TEMPERATURE=ՏԱԳՆԱՊ՝ ջերմաստիճանը
ALARM_SETTING_HEALTH_STATUS=ՏԱԳՆԱՊ՝ տեխնիկական վիճակը
SHOW_MAIN_WINDOW=Ցուցադրել գլխավոր պատուհանը
SHOW_TEMPERATURE_ICON=Ցուցադրել ջերմաստիճանի պատկերակը
SHOW_ALL_TEMPERATURE_ICON=Ցուցադրել բոլորի ջերմաստիճանը
HIDE_ALL_TEMPERATURE_ICON=Թաքցնել ջերմաստիճանը
COLLECTIVE_SETTING=Ընդհանուր կարգավորումներ
GRAPH=Գրաֆ
;Added 3.0
SHOW_TEMPERATURE_ICON_ONLY=Ցուցադրել միայն ջերմաստիճանի ցուցիչը

[DiskStatus]
GOOD=Լավ
CAUTION=Ուշադրություն
BAD=Վատ է
UNKNOWN=Հայտնի չէ
DISK=Սկավառակ

[Dialog]
LIST_ID=ID
LIST_CURRENT=Ընթացիկ
LIST_WORST=Վատագույնը
LIST_THRESHOLD=Սահմանայինը
LIST_RAW_VALUES=Hex արժեք
;LIST_DESCRIPTION=Նկարագրություն
LIST_ATTRIBUTE_NAME=Հատկանիշի անուն

FIRMWARE=Ներդրիչի տարբերակ
SERIAL_NUMBER=Հերթական համար
INTERFACE=Միջերես
STANDARD=Ստանդարտ
TRANSFER_MODE=Տվյալների փոխանցում
BUFFER_SIZE=Պահնակի չափ
NV_CACHE_SIZE=NV շտեմի չափ
ROTATION_RATE=Պտույտի արագ.
TEMPERATURE=Ջերմաստիճան
POWER_ON_HOURS=Աշխատելու ժամանակը
POWER_ON_COUNT=Միացումների քանակը
DRIVE_LETTER=Սկավառակի տառ
FEATURE=Ընտրանքներ
HEALTH_STATUS=Տեխնիկական վիճակ

UNKNOWN=Անհայտ
POWER_ON_COUNT_UNIT=քանակ
POWER_ON_HOURS_UNIT=ժամ
POWER_ON_DAYS_UNIT=օր

;4.3
TOTAL_HOST_WRITES=Total Host Writes
TOTAL_HOST_READS=Total Host Reads
TOTAL_NAND_WRITES=Total NAND Writes

;4.5
WEAR_LEVELING_COUNT=Wear Leveling-ի կիրառում

;6.1
CURRENT_MODE_SUPPORTED_MODE=Ընթացիկ եղանակ | Աջակցվող եղանակ
MAJOR_VERSION_MINOR_VERSION=Հիմնական տարբերակ | Երկրորդական տարբերակ

[Message]
DETECT_UNIT_POWER_ON_HOURS=Սկավառակների աշխատանքի ժամանակը (կպահանջվի 130 վ.)
DETECT_DISK=Սկավառակի հայտնաբերում
PLEASE_ENABLE_WMI=Միացրեքլ WMI-ը (Windows Management Instrumentation)
PLEASE_RESTART_THIS_APPLICATION=Վերաբացեք ծրագիրը
DISK_NOT_FOUND=Սկավառակը չի գտնվել

[Alarm]
ALARM_TEMPERATURE=ՏԱԳՆԱՊ՝ ջերմաստիճան
ALARM_HEALTH_STATUS=ՏԱԳՆԱՊ՝ տեխնիկական վիճակ
DEGRADATION=Վատացում
RECOVERY=Վերականգնում
;3.5.0
INFO_HEALTH_STATUS=Վիճակի մասին

[Graph]
PLEASE_SELECT_ITEM=Ընտրեք տարրը
ACTUAL_VALUE=Փաստացի նշանակությունը (Hex արժեքը)
NORMALIZED_VALUE=Նորմալացված նշանակությունը (ընթացիկ)
ALL_ON=Միշտ միաց.
ALL_OFF=Միշտ անջ.
RESET=Թողնել

[Customize]
LINE_COLOR=Տողերի գույնը
BACKGROUND_IMAGE=Խորապատկեր
SUPPORTED_IMAGE_FORMAT=Աջակցվող պատկերներ
ALL_FILES=Բոլոր ֆայլերը

;5.0.0
SUPPORTED_SOUND_FORMAT=Ձայնի աջակցվող տեսակներ

[AamApm]
AAM_LOW=<- Լուռ (80h)
AAM_HIGH=Արդյունավետություն (FEh) ->
AAM_RECOMMEND=Հանձնարարելի արժեք
APM_LOW=<- Տնտեսող (01h)
APM_HIGH=Արդյունավետություն (FEh) ->
;3.5.0
AUTOMATIC_ACOUSTIC_MANAGEMENT=Աղմուկի ինքնաշխատ կառավարում (AAM)
ADVANCED_POWER_MANAGEMENT=Սնուցման ինքնաշխատ կառավարում (APM)

[WindowTitle]
ABOUT=CrystalDiskInfo ծրագրի մասին
GRAPH=Գրաֆ
CUSTOMIZE=Կարգավորումներ
VERSION_INFORMATION=Տարբերակ
AAM_APM_CONTROL=AAM/APM-ի կառավարում
HEALTH_STATUS_SETTING=Առողջության վիճակի կարգավորումներ

;5.0.0
ALARM_HISTORY=Տագնապի պատմություն
SOUND_SETTINGS=Ձայնի կարգավորումներ

;5.1.0
FONT_SETTING=Տառատեսակ

[HealthStatus]
THRESHOLD_OF_CAUTION=Սահմանային նշանակություն
APPLY=Կիրառել
DEFAULT=Ծրագրային

[Smart]
UNKNOWN=Հայտնի չէ
VENDOR_SPECIFIC=Vendor Specific
01=Read Error Rate
02=Throughput Performance
03=Spin-Up Time
04=Start/Stop Count
05=Reallocated Sectors Count
06=Read Channel Margin
07=Seek Error Rate
08=Seek Time Performance
09=Power-On Hours
0A=Spin Retry Count
0B=Recalibration Retries
0C=Power Cycle Count
0D=Soft Read Error Rate stab
B8=End-to-End Error
BB=Reported Uncorrectable Errors
BC=Command Timeout
BD=High Fly Writes
BE=Airflow Temperature
BF=G-Sense Error Rate
C0=Power-off Retract Count
C1=Load/Unload Cycle Count
C2=Temperature
C3=Hardware ECC recovered
C4=Reallocation Event Count
C5=Current Pending Sector Count
C6=Uncorrectable Sector Count
C7=UltraDMA CRC Error Count
C8=Write Error Rate
C9=Soft Read Error Rate
CA=Data Address Mark Error
CB=Run Out Cancel
CC=Soft ECC Correction
CD=Thermal Asperity Rate
CE=Flying Height
CF=Spin High Current
D0=Spin Buzz
D1=Offline Seek Performance
D3=Vibration During Write
D4=Shock During Write
DC=Disk Shift
DD=G-Sense Error Rate
DE=Loaded Hours
DF=Load/Unload Retry Count
E0=Load Friction
E1=Load/Unload Cycle Count
E2=Load 'In'-time
E3=Torque Amplification Count
E4=Power-Off Retract Cycle
E6=GMR Head Amplitude
E7=Temperature
F0=Head Flying Hours
FA=Read Error Retry Rate
FE=Free Fall Protection

;Updated 5.4.0
F1=Total Host Writes
F2=Total Host Reads

[SmartSsd]
01=Read Error Rate
02=Throughput Performance
03=Spin-Up Time
04=Start/Stop Count
05=Reallocated Sectors Count
06=Read Channel Margin
07=Seek Error Rate
08=Seek Time Performance
09=Power-On Hours
0A=Spin Retry Count
0B=Recalibration Retries
0C=Power Cycle Count
0D=Soft Read Error Rate stab
C0=Unsafe Shutdown Count
C2=Temperature
C4=Reallocation Event Count
C5=Current Pending Sector Count
C6=Uncorrectable Sector Count
; CrystalDiskInfo assign
FF=Մնացած կյանքը

;Updated 5.4.0
F1=Total Host Writes
F2=Total Host Reads

[SmartMtron]
BB=Total Erase Count

[SmartIndlinx]
01=Read Error Rate
09=Power-On Hours
0C=Power Cycle Count
B8=Initial Bad Block Count
C2=Temperature
C3=Program Failure Block Count
C4=Erase Failure Block Count
C5=Read Failure Block Count
C6=Total Count of Read Sectors
C7=Total Count of Write Sectors
C8=Total Count of Read Commands
C9=Total Count of Write Commands
CA=Total Count of Error bits from flash
CB=Total Count of Read Sectors with Correctable Bit Errors
CC=Bad Block Full Flag
CD=Maximum PE Count Specification
CE=Minimum Erase Count
CF=Maximum Erase Count
D0=Average Erase Count
D1=Remaining Drive Life

[SmartJMicron60x]
09=Power-On Hours
0C=Power Cycle Count
C2=Temperature
E5=Halt System ID, Flash ID
E8=Firmware Version Information
E9=ECC Fail Record
EA=Average Erase Count, Max Erase Count
EB=Good Block Count, System Block Count

[SmartIntel]
03=Spin Up Time
04=Start/Stop Count
05=Re-Allocated Sector Count
09=Power-On Hours Count
0C=Power Cycle Count
C0=Unsafe Shutdown Count
E1=Host Writes
E8=Available Reserved Space
E9=Media Wearout Indicator
B8=End to End Error Detection Count

;Updated 4.1
AA=Available Reserved Space
AB=Program Fail Count
AC=Erase Fail Count
BB=Uncorrectable Error Count

;Updated 4.3
AE=Unexpected Power Loss
E2=Timed Workload Media Wear
E3=Timed Workload Host Read/Write Ratio
E4=Timed Workload Timer
F1=Total LBAs Written
F2=Total LBAs Read
F9=Total NAND Writes

;Updated 5.5.0
B7=SATA Downshift Count
BE=Temperature
C7=CRC Error Count

;Updated 5.6.1
AF=Power Loss Protection Failure
C2=Temperature
C5=Pending Sector Count

;Added 6.6.0
EA=Thermal Throttle Status

[SmartSamsung] ;Updated (4.3)
05=Reallocated Sector Count
09=Power-on Hours
0C=Power-on Count
AF=Program Fail Count (Chip)
B0=Erase Fail Count (Chip)
B1=Wear Leveling Count
B2=Used Reserved Block Count (Chip)
B3=Used Reserved Block Count (Total)
B4=Unused Reserved Block Count (Total)
B5=Program Fail Count (Total)
B6=Erase Fail Count (Total)
B7=Runtime Bad Block (Total)
BB=Uncorrectable Error Count
BE=Airflow Temperature
C2=Temperature
C3=ECC Error Rate
C6=Off-Line Uncorrectable Error Count
C7=CRC Error Count
C9=Super cap Status
CA=SSD Mode Status
EB=POR Recovery Count
F1=Total LBA Written
F2=Total LBA Read

;Added 6.6
AA=Unused Reserved Block Count (Chip) 
AB=Program Fail Count (Chip)
AC=Erase Fail Count (Chip)
AD=Wear Leveling Count
AE=Unexpected Power Loss Count
B8=Error Detection
E9=Normalized Media Wear-out

[SmartSandForce] ;Updated (3.7.0)
01=Raw Read Error Rate
05=Retired Block Count
09=Power-on Hours
0C=Power Cycle Count
0D=Soft Read Error Rate
64=Gigabytes Erased
AA=Reserve Block Count
AB=Program Fail Count
AC=Erase Fail Count
AE=Unexpected Power Loss Count
B1=Wear Range Delta
B5=Program Fail Count
B6=Erase Fail Count
B8=Reported I/O Error Detection Code Errors
BB=Reported Uncorrectable Errors
C2=Temperature
C3=On-the-Fly ECC Uncorrectable Error Count
C4=Reallocation Event Count
C6=Uncorrectable Sector Count
C7=SATA R-Errors (CRC) Error Count
C9=Uncorrectable Soft Read Error Rate
CC=Soft ECC Correction Rate
E6=Life Curve Status
E7=SSD Life Left
E8=Available Reserved Space
EB=SuperCap health
F1=Lifetime Writes from Host
F2=Lifetime Reads from Host

[SmartJMicron61x] ;Added (3.9)
01=Read Error Rate
02=Throughput Performance
03=Spin-Up Time
05=Reallocated Sectors Count
07=Seek Error Rate
08=Seek Time Performance
09=Power-On Hours
0A=Spin Retry Count
0C=Power Cycle Count
A8=SATA PHY Error Count
AF=Bad Cluster Table Count (ECC Fail Count)
C0=Unexpected Power Loss Count
C2=Temperature
C5=Current Pending Sector Count
AA=Bad Block Count
AD=Erase Count

[SmartMicron] ;Added 4.0.0/ Updated 6.6.0
; RAIN = Redundant Array of Independent NAND
01=Raw Read Error Rate
05=Reallocated NAND Blocks
09=Power On Hours
0C=Power Cycle Count
0D=Soft Error Rate
0E=Device Capacity (NAND)
0F=User Capacity
10=Spare Blocks Available
11=Remaining Spare Blocks
64=Total Erase Count
AA=Reserved Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Average Block-Erase Count
AE=Unexpected Power Loss Count
B4=Unused Reserve NAND Blocks
B5=Unaligned Access Count
B7=SATA Interface Downshift
B8=Error Correction Count
BB=Reported Uncorrectable Errors
BC=Command Timeout Count
BD=Factory Bad Block Count
C2=Temperature
C3=Cumulative ECC Bit Correction Count
C4=Reallocation Event Count
C5=Current Pending Sector Count
C6=Smart Off-line Scan Uncorrectable Error Count
C7=Ultra DMA CRC Error Rate
CA=Percent Lifetime Used
CE=Write Error Rate
D2=Successful RAIN Recovery Count
EA=Total Bytes Read
F2=Write Protect Progress
F3=ECC Bits Corrected
F4=ECC Cumulative Threshold Events
F5=Cumulative Program NAND Pages
F6=Total Host Sector Writes
F7=Host Program Page Count
F8=Background Program Page Count

[SmartMicronMU02] ;Updated 6.6.0
; RAIN = Redundant Array of Independent NAND
01=Raw Read Error Rate
05=Reallocated Sectors Count
09=Power-On Hours
0C=Power Cycle Count
0D=Soft Error Rate
0E=Device Capacity (NAND)
0F=User Capacity
10=Spare Blocks Available
11=Remaining Spare Blocks
64=Total Erase Count
AA=Reserved Block Count
AB=Program Fail Count
AC=Erase Fail Count
AD=Average Block-Erase Count
AE=Unexpected Power Loss Count
B4=Unused Reserve NAND Blocks
B7=SATA Interface Downshift
B8=Error Correction Count
BB=Reported Uncorrectable Errors
BC=Command Timeout Count
BD=Factory Bad Block Count
C2=Temperature
C3=Cumulative ECC Bit Correction Count
C4=Reallocation Event Count
C5=Current Pending Sector Count
C6=Smart Off-line Scan Uncorrectable Error Count
C7=Ultra DMA CRC Error Rate
CA=Percent Lifetime Used
CE=Write Error Rate
D2=Successful RAIN Recovery Count
EA=Total Bytes Read
F3=ECC Bits Corrected
F4=ECC Cumulative Threshold Events
F5=Cumulative Program NAND Pages
F6=Total Host Sector Writes
F7=Host Program Page Count
F8=Background Program Page Count

; Updated 6.6.0
A0=Uncorrectable Sector Count
A1=Valid Spare Blocks
A3=Initial Invalid Blocks
94=Total SLC Erase Count
95=Maximum SLC Erase Count
96=Minimum SLC Erase Count
97=Average SLC Erase Count
A4=Total TLC Erase Count
A5=Maximum TLC Erase Count
A6=Minimum TLC Erase Count
A7=Average TLC Erase Count
A9=Percentage Lifetime Remaining
B5=Program Fail Count
B6=Erase Fail Count
C0=Power-off Retract Count
E8=Available Reserved Space
F1=Total LBA Write
F2=Total LBA Read
F5=Total TLC Write Count
F6=Total SLC Write Count
F7=RAID Recovery Count

[SmartOcz] ;Added 4.5.0
01=Raw Read Error Rate
03=Spin Up Time
04=Start Stop Count
05=Reallocated Sectors Count
09=Power-On Hours
0C=Power Cycle Count
C2=Temperature
E8=Total Count of Write Sectors
E9=Remaining Life

; Added 6.6.0
64=Total Blocks Erased
A7=SSD Protect Mode
A8=SATA PHY Error Count
A9=Bad Block Count
AD=Erase Count
B8=Factory Bad Block Count
C0=Unexpected Power Loss Count
CA=Total Number of Corrected Bits
CD=Max Rated PE Counts
CE=Minimum Erase Counts
CF=Maximum Erase Counts
D3=SATA Uncorrectable Error Count
D4=NAND Page Reads During Retry
D5=Simple Read Retry Attempts
D6=Adaptive Read Retry Attempts
DD=Internal Data Path Uncorrectable Errors
DE=RAID Recovery Count
E6=Power Loss Protection
FB=NAND Read Count

;Updated 6.7.0
F1=Total Host Writes
F2=Total Host Reads

[SmartPlextor] ;Added 5.1.0
01=Read Error Rate
05=Reallocated Sectors Count
09=Power-On Hours
0C=Power Cycle Count
C0=Unsafe Shutdown Count
C2=Temperature
C4=Reallocation Event Count
C6=Uncorrectable Sector Count
F1=Total LBA written
F2=Total LBA read

;Updated 5.4.0
B1=Wear Leveling Count
B2=Used Reserved Block Count (Worst Case)
B5=Program Fail Count (Total)
B6=Erase Fail Count (Total)
BB=Uncorrectable Error Count
C7=CRC Error Count
E8=Available Reserved Space

;Added 6.2.0
AA=Grown Bad Blocks
AB=Program Fail Count (Total)
AC=Erase Fail Count (Total)
AD=Average Program/Erase Count (Total)
AE=Unexpected Power Loss Count
AF=Program Fail Count (Worst Case)
B0=Erase Fail Count (Worst Case)
B3=Used Reserved Block Count (Total)
B4=UnUsed Reserved Block Count (Total)
B7=SATA Interface Down Shift
B8=End-to-End Data Errors Corrected
BC=Command Time out
C3=ECC rate
E9=NAND GB written

[SmartSanDisk] ;Added 5.2.0
05=Retired Block Count
09=Power On Hours
0C=Power Cycle Count
AA=Reserve Block Count
AB=Program Fail Count
AC=Erase Fail Count
AE=Unexpected Power Loss Count
BB=Reported Uncorrectable Errors
C2=Temperature
E8=Remaining Life
F1=Total Host Writes
F2=Total Host Reads

[SmartOczVector] ;Added 5.3.0
05=Accumulated Runtime Bad Blocks
09=Power-On Hours Count
0C=Power Cycle Count
AB=Available Over-Provisioned Block Count
AE=Power Cycle Count (Unplanned)
BB=Total Uncorrectable NAND Reads
C2=Temperature
C3=Total Programming Failures
C4=Total Erase Failures
C5=Total Read Failures (Uncorrectable)
C6=Host Reads
C7=Host Writes
D0=Average Erase Count
D2=SATA CRC Error Count
E9=Remaining Life
F9=Total NAND Programming Count

;Updated 5.5.0
F1=Total Host Writes
F2=Total Host Reads

;Updated 6.6.0
64=Total Blocks Erased
B8=Factory Bad Block Count Total
CA=Total Number Of Read Bits Corrected
CD=Max Rated PE Count
CE=Min Erase Count
CF=Max Erase Count
D4=Total Count NAND Pages Reads Requiring Read Retry
D5=Total Count of Simple Read Retry Attempts
D6=Total Count of Adaptive Read Retry Attempts
DD=Internal Data Path Protection Uncorrectable Errors
DE=RAID Recovery Count
E0=In Warranty
E1=DAS Polarity
E2=Partial Pfail
E6=Write Throttling Activation Flag
F9=Total NAND Programming Count (pages)
FB=Total NAND Read Count

[SmartCorsair] ;Added 6.2.0
01=Raw Read Error Rate
05=Retired Block Count
09=Power On Hours
0C=Power Cycle Count
AA=Reserve Block Count
AC=Erase Fail Count
AE=Unexpected Power Loss Count
B5=Program Fail Count
BB=Reported Uncorrectable Errors
C2=Temperature
C4=Reallocation Event Count
E7=SSD Life Left
F1=Lifetime GB Written
F2=Lifetime GB Read

[SmartToshiba] ;Added 6.2.0
01=Read Error Rate
02=Throughput Performance
03=Spin-Up Time
04=Start/Stop Count
05=Reallocated Sectors Count
07=Seek Error Rate
08=Seek Time Performance
09=Power-On Hours
0A=Spin Retry Count
0B=Recalibration Retries
0C=Power Cycle Count
A7=SSD Protect Mode
A8=SATA PHY Error Count
A9=Total Bad Block Count
AD=Erase Count
C0=Unexpected Power Loss Count
C2=Temperature
C4=Reallocation Event Count
C5=Current Pending Sector Count
C6=Uncorrectable Sector Count
F1=Total Host Writes
F2=Total Host Reads

[SmartSanDiskGb] ;Added 6.2.0
05=Reallocated Block Count
09=Power On Hours
0C=Power Cycle Count
A6=Min W/E Cycle
A7=Max Bad Block/Die
A8=Maximum Erase Cycle
A9=Total Bad Block
AB=Program Fail Count
AC=Erase Fail Count
AD=Average Erase Cycle
AE=Unexpected Power Loss Count
BB=Reported Uncorrectable Errors
C2=Temperature
D4=SATA PHY Error
E6=Percentage Total P/E Count
E8=Spare Block Remaining
E9=Total GB Written To NAND
F1=Total GB Written
F2=Total GB Read

[SmartKingston] ;Added 6.6.0
01=Read Error Rate
02=Throughput Performance
03=Spin Up Time
05=Reallocated Sectors Count
07=Seek Error Rate
08=Seek Time Performance
09=Power-On Hours
0A=Spin Retry Count
0C=Power Cycle Count
A8=SATA PHY Error Count
AA=Bad Block Count
AD=Erase count
AF=Bad Cluster Table Count
BB=Uncorrectable Errors
C0=Unsafe Shutdown Count
C2=Temperature
C4=Later Bad Block Count
C5=Current Pending Sector Count
C7=CRC Error Count
DA=CRC Error Count
E7=SSD Life Left
E9=Lifetime Writes to Flash
F0=Write Head
F1=Host Writes
F2=Host Reads
F4=Average Erase Count
F5=Max Erase Count
F6=Total Erase Count

[SmartNVMe] ;Added 6.7.0
01=Critical Warning
02=Composite Temperature
03=Available Spare
04=Available Spare Threshold
05=Percentage Used
06=Data Units Read
07=Data Units Written
08=Host Read Commands
09=Host Write Commands
0A=Controller Busy Time
0B=Power Cycles
0C=Power On Hours
0D=Unsafe Shutdowns
0E=Media and Data Integrity Errors
0F=Number of Error Information Log Entries

[SmartRealtek] ;Added by Realtek
01=Raw data error rate
05=Reallocated sector count
09=Power on hour count
0C=Power cycle count
A1=GDN
A2=Total erase count
A3=Max PE cycle
A4=Average erase count
A5=Initial bad block count
A6=Total bad block count
A7=SSD protect mode
A8=SATA Phy error count
A9=Health
AB=Program fail count
AC=Erase fail count
AE=Unexpected power loss count
AF=ECC fail count
B5=Unaligned access count
BB=Reported uncorrectable error
C2=Enclosure temperature
C3=Cumulative corrected ecc
C4=Reallocation event count
C7=Ultra DMA CRC error count
CE=Min. erase count
CF=Max erase count
E7=Lifetime left
E8=Available reserved space
F1=Write life time
F2=Read life time
F9=Total GB written to NAND (TLC)
FA=Total GB written to NAND (SLC)

[SmartSKhynix] ; Add 2019-05-14 (ex. SC308)
01=Read Error Rate
05=Re-Assigned Sector Count
09=Power-On Hours
0C=Power Cycle Count
64=Total Erase Count
AB=Program Fail Count
AC=Erase Fail Count
AE=Unexpected Powwer Loss Count
AF=Program Fail Count(Worst Case)
B0=Erase Fail Count(Worst Case)
B1=Wear Leveling Count
B2=Used Reseved Block Count(Worst Case)
B3=Used Reseved Block Count(SSD Total)
B4=UnUsed Reseved Block Count(SSD Total)
B5=Program Fail Count(SSD Total)
B6=Erase Fail Count(SSD Total)
B7=SATA Downshift　Count
BB=Uncorrectable Error Count
BC=Command Timeout Count
BF=Op Shock Event Count
C2=Temperature
C3=ECC Rate
C7=CRC Error Count
C9=Uncorrectable Soft Read Error Rate
CC=Soft ECC Correction Rate
E7=SSD Life Left
EA=NAND Written
F1=Total LBA Written
F2=Total LBA Read
FA=Total Number of NAND Read Retries